app/controllers/bids_controller.rb

SELECT "bids".* FROM "bids"
---
  def index
    @bids = Bid.all