app/controllers/pieces_controller.rb

  def index
    @pieces = Piece.all
---
SELECT "pieces".* FROM "pieces"

  def create
    @piece = Piece.new(piece_params)

    if @piece.save
---
INSERT INTO "pieces" ("name", "title", "description", "minimum_bid", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Drawing1"], ["title", "Drawing1"], ["description", "drawings"], ["minimum_bid", 600], ["user_id", 6], ["created_at", 2017-02-20 20:57:57 UTC], ["updated_at", 2017-02-20 20:57:57 UTC]]

    def set_piece
      @piece = Piece.find(params[:id])
---
SELECT  "pieces".* FROM "pieces" WHERE "pieces"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]